УТ_для_edt/src/DataProcessors/CRM_МенеджерПочты/CRM_МенеджерПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МенеджерПочты</name>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/CRM_УчетныеЗаписиЭлектроннойПочты/CRM_УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_УчетныеЗаписиЭлектроннойПочты</name>
  <resources>
    <name>Администрирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Запись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/ИсполнителиЗадач/ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиЗадач</name>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ПодписиУчетныхЗаписей/CRM_ПодписиУчетныхЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ПодписиУчетныхЗаписей</name>
  <attributes>
    <name>ПодписьИсходящегоПисьма</name>
    <type>
      <types>CatalogRef.CRM_Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписьПересылаемогоПисьма</name>
    <type>
      <types>CatalogRef.CRM_Подписи</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <comment>АПК:58</comment>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСкрытыеКопииПисемНаЭтотАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецУчетнойЗаписи</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_ДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НастройкаСинхронизацииСВнешнимПриложением</name>
    <type>
      <types>CatalogRef.CRM_ПрограммыMSOutlook</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПодписьВнизуПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешитьПросмотрПисемВсемПользователям</name>
    <comment>Разрешить просмотр писем всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВыгружатьВiCRM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЭтоОбщаяУчетнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СинхронизироватьПапкиСПочтовымСервером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтображатьТолькоПодписанныеПапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПереноситьВОбработанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЗадаватьВопросПриПереносеВОбработанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриОтправкеПисемТребуетсяАвторизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_Подписи/CRM_Подписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Подписи</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Пользователь, с которым связана подпись</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_МенеджерПочты/Forms/ФормаНастроек/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Работа с пользователями
	Если Параметры.Свойство("Пользователь") Тогда
		ТекущийПользователь = Параметры.Пользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	
	ИмяПользователяИБ = Неопределено;
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийПользователь.ИдентификаторПользователяИБ);
	Если ПользовательИБ <> Неопределено Тогда
		ИмяПользователяИБ = ПользовательИБ.Имя;
	КонецЕсли;
	
	Если ТекущийПользователь <> Пользователи.ТекущийПользователь() И ИмяПользователяИБ = Неопределено Тогда
		// Если пользователю не сопоставлен пользователь ИБ, то эти настройки только для текущего и отображать их нет смысла.
		Элементы.ОсновнаяУчетнаяЗапись.ТолькоПросмотр	= Истина;
		Элементы.ОсновнаяУчетнаяЗапись.Видимость		= Ложь;
		Элементы.ТаймаутОтметкиОПрочтении.ТолькоПросмотр	= Истина;
		Элементы.ТаймаутОтметкиОПрочтении.Видимость		= Ложь;
		Элементы.ПоказыватьВсеВложения.ТолькоПросмотр	= Истина;
		Элементы.ПоказыватьВсеВложения.Видимость		= Ложь;
	КонецЕсли;
	
	// Основная учетная запись
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПользовательИБ <> Неопределено И ПравоДоступа("Чтение", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты) Тогда
	
		ОсновнаяУчетнаяЗапись = ХранилищеОбщихНастроек.Загрузить("ОсновнаяУчетнаяЗапись", "ОсновнаяУчетнаяЗапись",, ИмяПользователяИБ);
		Если ОсновнаяУчетнаяЗапись = Неопределено Тогда
			ОсновнаяУчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
		КонецЕсли;
		Если ЗначениеЗаполнено(ОсновнаяУчетнаяЗапись) Тогда
			 ОсновнаяУчетнаяЗаписьПредставление = ВзаимодействияКлиентСервер.ПолучитьПредставлениеАдресата(ОсновнаяУчетнаяЗапись.ИмяПользователя, ОсновнаяУчетнаяЗапись.АдресЭлектроннойПочты,"");
		КонецЕсли;
	 
		// Заполнение списка выбора для выбора учётной записи
		CRM_УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписиДляОтправки(Элементы.ОсновнаяУчетнаяЗапись.СписокВыбора,,ТекущийПользователь);
		
		// Количество секунд, после истечения которого письмо помечается как прочитанное
		ТаймаутОтметкиОПрочтении = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ТаймаутОтметкиОПрочтении", "ТаймаутОтметкиОПрочтении", 5,, ИмяПользователяИБ);
		
		ПоказыватьВсеВложения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПоказыватьВсеВложения", "ПоказыватьВсеВложения", Ложь,, ИмяПользователяИБ);
	
	Иначе
		Элементы.ЭлектроннаяПочта.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаполнитьТаблицуУчетныхЗаписей();
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Настройки почты для %1';en='Mail settings for %1'"),
					Строка(ТекущийПользователь));
					
					
	// Загрузка Дополнительных настроек
	ОтправлятьПисьмаВФорматеHTML = ПолучитьФункциональнуюОпцию("ОтправлятьПисьмаВФорматеHTML");
	НастройкиХранилище = Взаимодействия.ПолучитьНастройкуРаботаСПочтой();
	
	ВключатьПодписьДляНовыхСообщений             = ?(НастройкиХранилище.Свойство("ВключатьПодписьДляНовыхСообщений"),
		НастройкиХранилище.ВключатьПодписьДляНовыхСообщений,Истина);
	ФорматПодписиДляНовыхСообщений               = ?(НастройкиХранилище.Свойство("ФорматПодписиДляНовыхСообщений") И ОтправлятьПисьмаВФорматеHTML,
		НастройкиХранилище.ФорматПодписиДляНовыхСообщений,
		ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст"));
	ВключатьПодписьПриОтветеПересылке            = ?(НастройкиХранилище.Свойство("ВключатьПодписьПриОтветеПересылке"),
		НастройкиХранилище.ВключатьПодписьПриОтветеПересылке,Истина);
	ФорматПодписиПриОтветеПересылке              = ?(НастройкиХранилище.Свойство("ФорматПодписиПриОтветеПересылке") И ОтправлятьПисьмаВФорматеHTML,
		НастройкиХранилище.ФорматПодписиПриОтветеПересылке,
		ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст"));
	ПорядокОтветовНаЗапросыУведомленийОПрочтении = ?(НастройкиХранилище.Свойство("ПорядокОтветовНаЗапросыУведомленийОПрочтении"),
		НастройкиХранилище.ПорядокОтветовНаЗапросыУведомленийОПрочтении,
		ПредопределенноеЗначение("Перечисление.ПорядокОтветовНаЗапросыУведомленийОПрочтении.ЗапрашиватьПередТемКакОтправитьУведомление"));
	ВсегдаЗапрашиватьУведомлениеОПрочтении       = ?(НастройкиХранилище.Свойство("ВсегдаЗапрашиватьУведомлениеОПрочтении"),
		НастройкиХранилище.ВсегдаЗапрашиватьУведомлениеОПрочтении,Ложь);
	ВсегдаЗапрашиватьУведомленияОДоставке        = ?(НастройкиХранилище.Свойство("ВсегдаЗапрашиватьУведомленияОДоставке"),
		НастройкиХранилище.ВсегдаЗапрашиватьУведомленияОДоставке,Ложь);
	НовоеСообщениеФорматированныйДокумент        = ?(НастройкиХранилище.Свойство("НовоеСообщениеФорматированныйДокумент"),
		НастройкиХранилище.НовоеСообщениеФорматированныйДокумент,Неопределено);
	ПодписьДляНовыхСообщенийПростойТекст         = ?(НастройкиХранилище.Свойство("ПодписьДляНовыхСообщенийПростойТекст"),
		НастройкиХранилище.ПодписьДляНовыхСообщенийПростойТекст,Неопределено);
	ПодписьПриОтветеПересылкеПростойТекст        = ?(НастройкиХранилище.Свойство("ПодписьПриОтветеПересылкеПростойТекст"),
		НастройкиХранилище.ПодписьПриОтветеПересылкеПростойТекст,Неопределено);
	ПриОтветеПересылкеФорматированныйДокумент    = ?(НастройкиХранилище.Свойство("ПриОтветеПересылкеФорматированныйДокумент"),
		НастройкиХранилище.ПриОтветеПересылкеФорматированныйДокумент,Неопределено);
	ОтображатьТелоИсходногоПисьма                = ?(НастройкиХранилище.Свойство("ОтображатьТелоИсходногоПисьма"),
		НастройкиХранилище.ОтображатьТелоИсходногоПисьма,Ложь);
	ВключатьТелоИсходногоПисьма                  = ?(НастройкиХранилище.Свойство("ВключатьТелоИсходногоПисьма"),
		НастройкиХранилище.ВключатьТелоИсходногоПисьма,Ложь);
	ОтправлятьСообщенияСразу                     = ?(НастройкиХранилище.Свойство("ОтправлятьСообщенияСразу"),
		НастройкиХранилище.ОтправлятьСообщенияСразу,Ложь);

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПередЗакрытием".
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			ТекстПредупреждения = НСтр("ru='При завершении работы в форме ""';en='Upon completion of work in the form of ""'") + Заголовок + НСтр("ru='"" все изменения будут утеряны.'");
			Возврат;
		Иначе
			Отказ = Истина;
			ОбратныйВызов = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОбратныйВызов, НСтр("ru='Настройки были изменены. Сохранить изменения?';en='Settings were changed. Save changes?'"), РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик ответа на вопрос перед закрытием формы.
//
// Параметры:
//	Результат				- КодВозвратаДиалога	- Ответ на вопрос.
//	ДополнительныеПараметры	- Структура				- Структура дополнительных параметров.
//
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	РезультатФормы = Ложь;
	
    Если Результат = КодВозвратаДиалога.Да Тогда
		РезультатФормы = Истина;
		Отказ = ВыполнитьСохранениеНастроекПередЗакрытием();
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Закрыть(РезультатФормы);
	КонецЕсли;	
	
КонецПроцедуры // ПередЗакрытиемЗавершение()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	ВыполнитьСохранениеНастроекПередЗакрытием();
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсновнаяУчетнаяЗаписьОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ОсновнаяУчетнаяЗапись) Тогда
		ПоказатьЗначение(,ОсновнаяУчетнаяЗапись);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяУчетнаяЗаписьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ПроверитьЧтоУчетнаяЗаписьИспользуетсяДляОтправки(ВыбранноеЗначение) Тогда
		ПоказатьПредупреждение(,Нстр("ru='В данной учётной записи отключена отправка писем!';en='In this account, sending letters is disabled!'"));
		СтандартнаяОбработка = Ложь;				
		Возврат;
	КонецЕсли;
	
	ОсновнаяУчетнаяЗапись = ВыбранноеЗначение;
	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭлементСписка <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ОсновнаяУчетнаяЗаписьПредставление = ЭлементСписка.Представление;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяУчетнаяЗаписьОчистка(Элемент, СтандартнаяОбработка)
	
	ОсновнаяУчетнаяЗапись = ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка");
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНастроекПочты

&НаКлиенте
Процедура ПодписьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", ТекущийПользователь));
	ОткрытьФорму("Справочник.CRM_Подписи.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройки()
	
	Если ФорматПодписиДляНовыхСообщений <> Перечисления.СпособыРедактированияЭлектронныхПисем.HTML Тогда
		
		ПодписьДляНовыхСообщенийФорматированныйДокумент = Неопределено;
		
	Иначе
		
		ПодписьДляНовыхСообщенийПростойТекст = НовоеСообщениеФорматированныйДокумент.ПолучитьТекст();
		
	КонецЕсли;
	
	Если ФорматПодписиПриОтветеПересылке <> Перечисления.СпособыРедактированияЭлектронныхПисем.HTML Тогда
		
		ПодписьПриОтветеПересылкеФорматированныйДокумент = Неопределено;
		
	Иначе
		
		ПодписьПриОтветеПересылкеПростойТекст = ПриОтветеПересылкеФорматированныйДокумент.ПолучитьТекст();
		
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ВключатьПодписьДляНовыхСообщений", ВключатьПодписьДляНовыхСообщений);
	СтруктураНастройки.Вставить("ВключатьПодписьПриОтветеПересылке", ВключатьПодписьПриОтветеПересылке);
	СтруктураНастройки.Вставить("ВсегдаЗапрашиватьУведомлениеОПрочтении", ВсегдаЗапрашиватьУведомлениеОПрочтении);
	СтруктураНастройки.Вставить("ВсегдаЗапрашиватьУведомленияОДоставке", ВсегдаЗапрашиватьУведомленияОДоставке);
	СтруктураНастройки.Вставить("НовоеСообщениеФорматированныйДокумент", НовоеСообщениеФорматированныйДокумент);
	СтруктураНастройки.Вставить("ПодписьДляНовыхСообщенийПростойТекст", ПодписьДляНовыхСообщенийПростойТекст);
	СтруктураНастройки.Вставить("ПодписьПриОтветеПересылкеПростойТекст", ПодписьПриОтветеПересылкеПростойТекст);
	СтруктураНастройки.Вставить("ПорядокОтветовНаЗапросыУведомленийОПрочтении", ПорядокОтветовНаЗапросыУведомленийОПрочтении);
	СтруктураНастройки.Вставить("ПриОтветеПересылкеФорматированныйДокумент", ПриОтветеПересылкеФорматированныйДокумент);
	СтруктураНастройки.Вставить("ФорматПодписиДляНовыхСообщений", ФорматПодписиДляНовыхСообщений);
	СтруктураНастройки.Вставить("ФорматПодписиПриОтветеПересылке", ФорматПодписиПриОтветеПересылке);
	СтруктураНастройки.Вставить("ОтображатьТелоИсходногоПисьма", ОтображатьТелоИсходногоПисьма);
	СтруктураНастройки.Вставить("ВключатьТелоИсходногоПисьма", ВключатьТелоИсходногоПисьма);
	СтруктураНастройки.Вставить("ОтправлятьСообщенияСразу", ОтправлятьСообщенияСразу);

	Взаимодействия.СохранитьНастройкуРаботаСПочтой(СтруктураНастройки);

КонецПроцедуры
&НаСервере
// Процедура обновляет информацию в таблице учетных записей.
//
Процедура ЗаполнитьТаблицуУчетныхЗаписей()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НЕОПРЕДЕЛЕНО КАК Пользователь,
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК УчетнаяЗапись,
	|	УчетныеЗаписиЭлектроннойПочты.CRM_ЭтоОбщаяУчетнаяЗапись КАК ДоступнаДляВсех
	|ПОМЕСТИТЬ ПользователиУчетнойЗаписи
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CRM_УчетныеЗаписиЭлектроннойПочты.Пользователь,
	|	CRM_УчетныеЗаписиЭлектроннойПочты.УчетнаяЗапись,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.CRM_УчетныеЗаписиЭлектроннойПочты КАК CRM_УчетныеЗаписиЭлектроннойПочты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсполнителиЗадач.Исполнитель,
	|	CRM_УчетныеЗаписиЭлектроннойПочты.УчетнаяЗапись,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.CRM_УчетныеЗаписиЭлектроннойПочты КАК CRM_УчетныеЗаписиЭлектроннойПочты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|		ПО CRM_УчетныеЗаписиЭлектроннойПочты.Пользователь = ИсполнителиЗадач.РольИсполнителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиУчетнойЗаписи.УчетнаяЗапись КАК УчетнаяЗапись,
	|	CRM_ПодписиУчетныхЗаписей.ПодписьИсходящегоПисьма КАК ПодписьИсходящегоПисьма,
	|	CRM_ПодписиУчетныхЗаписей.УдалитьПодписьПересылаемогоПисьма КАК ПодписьПересылаемогоПисьма
	|ИЗ
	|	ПользователиУчетнойЗаписи КАК ПользователиУчетнойЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ПодписиУчетныхЗаписей КАК CRM_ПодписиУчетныхЗаписей
	|		ПО ПользователиУчетнойЗаписи.УчетнаяЗапись = CRM_ПодписиУчетныхЗаписей.УчетнаяЗапись
	|			И CRM_ПодписиУчетныхЗаписей.Пользователь = &Пользователь
	|ГДЕ
	|	(ПользователиУчетнойЗаписи.Пользователь = &Пользователь
	|			ИЛИ ПользователиУчетнойЗаписи.ДоступнаДляВсех)
	|	И НЕ ПользователиУчетнойЗаписи.УчетнаяЗапись.ПометкаУдаления";
	
	ТабЗнач = Запрос.Выполнить().Выгрузить();
    ЗначениеВРеквизитФормы(ТабЗнач, "ТаблицаНастроекПочты");
	
КонецПроцедуры // ЗаполнитьТаблицуУчетныхЗаписей()

&НаСервере
Процедура ОбновитьПодписиУчетныхЗаписей()
	
	НаборЗаписей = РегистрыСведений.CRM_ПодписиУчетныхЗаписей.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = ТекущийПользователь;
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаТаблицыНастроек Из ТаблицаНастроекПочты Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицыНастроек.ПодписьИсходящегоПисьма) ИЛИ ЗначениеЗаполнено(СтрокаТаблицыНастроек.ПодписьПересылаемогоПисьма) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.УчетнаяЗапись				= СтрокаТаблицыНастроек.УчетнаяЗапись; 
			НоваяЗапись.Пользователь				= ТекущийПользователь; 
			НоваяЗапись.ПодписьИсходящегоПисьма		= СтрокаТаблицыНастроек.ПодписьИсходящегоПисьма; 
			НоваяЗапись.УдалитьПодписьПересылаемогоПисьма	= СтрокаТаблицыНастроек.ПодписьПересылаемогоПисьма;
		КонецЕсли;	
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЧтоУчетнаяЗаписьИспользуетсяДляОтправки(УчетнаяЗапись)
	Возврат УчетнаяЗапись.ИспользоватьДляОтправки;
КонецФункции

// Вынесенная процедура сохранения изменений формы настроек.
//
&НаКлиенте
Функция ВыполнитьСохранениеНастроекПередЗакрытием()
	
	МассивСтруктур = Новый Массив;
	
	// Основная учетная запись
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "ОсновнаяУчетнаяЗапись");
	Элемент.Вставить("Настройка", "ОсновнаяУчетнаяЗапись");
	Элемент.Вставить("Значение", ОсновнаяУчетнаяЗапись);
	МассивСтруктур.Добавить(Элемент);
	
	// Таймаут отметки о прочтении
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "ТаймаутОтметкиОПрочтении");
	Элемент.Вставить("Настройка", "ТаймаутОтметкиОПрочтении");
	Элемент.Вставить("Значение", ТаймаутОтметкиОПрочтении);
	МассивСтруктур.Добавить(Элемент);
	
	// Показывать все вложения
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "ПоказыватьВсеВложения");
	Элемент.Вставить("Настройка", "ПоказыватьВсеВложения");
	Элемент.Вставить("Значение", ПоказыватьВсеВложения);
	МассивСтруктур.Добавить(Элемент);
	
	ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур);
	
	СохранитьНастройки();
	
	ОбновитьПодписиУчетныхЗаписей();
	
	Модифицированность = Ложь;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
// Процедура сохраняет массив пользовательских настроек МассивСтруктур. 
// Может применяться для случаев вызова с клиента.
// 
// Параметры:
//    МассивСтруктур - Массив - массив структур с полями "Объект", "Настройка", "Значение".
//    НужноОбновитьПовторноИспользуемыеЗначения - Булево - требуется обновить повторно используемые значения.
//
Процедура ХранилищеОбщихНастроекСохранитьМассив(МассивСтруктур, НужноОбновитьПовторноИспользуемыеЗначения = Ложь)
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийПользователь.ИдентификаторПользователяИБ);
	Если ПользовательИБ <> Неопределено Тогда
		ИмяПользователяИБ = ПользовательИБ.Имя;
		Для Каждого Элемент Из МассивСтруктур Цикл
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Элемент.Объект, Элемент.Настройка, Элемент.Значение,, ИмяПользователяИБ, НужноОбновитьПовторноИспользуемыеЗначения);
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для выбранного пользователя не сопоставлен пользователь информационной базы. Настройки не были сохранены.';en='The user of the information database is not mapped for the selected user. The settings were not saved.'"));
	КонецЕсли;
КонецПроцедуры // ХранилищеОбщихНастроекСохранитьМассив()

#КонецОбласти
